#+TITLE: Villan Ideas
#+OPTIONS: num:nil toc:1
#+STARTUP: entitiespretty
* Xaviard
/medium construct/humanoid, neutral evil/
- Armor Class :: 19
- Hit Points :: 162 (18d8+18)
- Speed :: 30ft., fly 30ft. (hover)
| STR | DEX | CON | INT | WIS | CHA |
|-----+-----+-----+-----+-----+-----|
|  10 |  16 |  13 |  20 |  14 |  16 |
|   0 |   3 |   1 |   5 |   2 |   3 |
#+TBLFM: @3=floor((@2-10)/2)
- Saving Throws :: INT+12, WIS+9
- Damage Resisistances :: Cold, Lightning, Necrotic, Bludgeoning, Piecing, Slashing
- Damage Immunities :: Force, Poison, Radiant, Necrotic
- Condition Immunities :: Charmed, Frightened, Paralyzed, Poisoned
- Senses :: Blindsight 120ft; Passive Perception 19
- Languages :: Common, Elvish, Dwarvish, Draconic, Gnomish
** TODO Traita
- Legendary Resistance (3/Day). :: If Xaviard fails a saving throw, he can choose to succeed instead.
** TODO Actions
** TODO Legendary Actions
** TODO Lair Actions
** Spellcasting
Xaviard is an 18th-level spellcaster. His spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks).
Xaviard has the following wizard spells prepared:
*** Cantrips
- [[http://dnd5e.wikidot.com/spell:booming-blade][Booming Blade]]
- [[http://dnd5e.wikidot.com/spell:guidance][Guidance]]
- [[http://dnd5e.wikidot.com/spell:lightning-lure][Lightning Lure]]
- [[http://dnd5e.wikidot.com/spell:mending][Mending]]
*** 1^st
- [[http://dnd5e.wikidot.com/spell:absorb-elements][Absorb Elements]]
- [[http://dnd5e.wikidot.com/spell:alarm][Alarm]]
- [[http://dnd5e.wikidot.com/spell:catapult][Catapult]]
- [[http://dnd5e.wikidot.com/spell:cure-wounds][Cure Wounds]][fn:1]
- [[http://dnd5e.wikidot.com/spell:false-life][False Life]]
- [[http://dnd5e.wikidot.com/spell:healing-word][Healing Word]][fn:1]
*** 2^nd
- [[http://dnd5e.wikidot.com/spell:guiding-bolt][Guiding Bolt]][fn:2]
- [[http://dnd5e.wikidot.com/spell:heat-metal][Heat Metal]]
*** 3^rd
-
*** 4^th
-
*** 5^th
-
*** 6^th
-
*** 7^th
-
*** 8^th
-
*** 9^th
-
** Associated Minions
- [[minions.html#clockwork-spider][Clockwork Spider]]
** Footnotes: Xaviard
[fn:1] (at-will, Can only effect creatures with the /construct/ tag, ignores regular spell restrictions)
